Pandas table:

Series (1d),    
DataFrames (2d),    
Panel (3d),     
Panel4D (4d),

create a series using a list in pandas

In [4]:
import pandas as pd

s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

to use differnt indexes

In [7]:
import pandas as pd

s1 = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
# using dictionary
import pandas as pd

di = {
    "a": 10,
    "b": 20,
    "c": 30,
    "d": 40,
    "e": 50
}
s1 = pd.Series(di)
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

create a series using a SCALER

In [12]:
import pandas as pd

s1 =pd.Series(5, index=['a', 'b', 'e', 'd', 'e'])
s1

a    5
b    5
e    5
d    5
e    5
dtype: int64

Vector operaations on seriess

In [ ]:
import pandas as pd

di = {
    "a": 10,
    "b": 20,
    "c": 30,
    "d": 40,
    "e": 50
}
s1 = pd.Series(di)
s2 = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])

s3 = pd.Series([1, 2, 3, 4, 5])
s4 = pd.Series(5, index=['a', 'b', 'e' ])

s5 = s1 + s2
s6 = s1 + s3
s7 = s2 + s4
# print(s5)
# print(s6)
# print(s7.dropna())
print(s6.fillna(3))  #both fillna and dropna returns a copy of edited Series
print(s6)

a    3.0
b    3.0
c    3.0
d    3.0
e    3.0
0    3.0
1    3.0
2    3.0
3    3.0
4    3.0
dtype: float64
a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
dtype: float64

create a dataframe for storing student details : firstname lastname age and city
keep atleast 5 entries

In [44]:
import pandas as pd

di = {
    "first_name": ["ram", "aman", "nigaar", "safee", "faizan"],
    "last_name": ["tripathi", "kumar", "khatoon", "singh", "kumar"],
    "age": [19, 20, 23, 24, 25],
    "city": ["varanasi", "delhi", "mumbai", "bangalore", "hyderabad"]
}

df = pd.DataFrame(di)
print(df)
print()
# display age for all the students
print(df['age'])
print()

# display the first and last name of all students
print(df[['first_name', 'last_name', 'city']])

  first_name last_name  age       city
0        ram  tripathi   19   varanasi
1       aman     kumar   20      delhi
2     nigaar   khatoon   23     mumbai
3      safee     singh   24  bangalore
4     faizan     kumar   25  hyderabad

0    19
1    20
2    23
3    24
4    25
Name: age, dtype: int64

  first_name last_name       city
0        ram  tripathi   varanasi
1       aman     kumar      delhi
2     nigaar   khatoon     mumbai
3      safee     singh  bangalore
4     faizan     kumar  hyderabad

In [34]:
# find the details of student who lives in kanpur
df['city'] == 'kanpur'  # returns a boolean series

df[df['city'] == 'delhi'] 
 # returns a dataframe

  first_name last_name  age   city
1       aman     kumar   20  delhi

In [ ]:
# find the first name of students who live in delhi
df[df['city'] == 'delhi']['first_name']

1    aman
Name: first_name, dtype: object

In [41]:
# display first name and city of student where age iss greater than 20
df[df['age']>20][['first_name', 'city']]

  first_name       city
2     nigaar     mumbai
3      safee  bangalore
4     faizan  hyderabad

# loc iloc
loc : asks for column name      
iloc : asks for index for colmn     
i- is refering to index here    
retriving using indexes of column instead of coumn name

In [47]:
# find age of student who live in delhi
l1 = df[df['city'] == 'delhi'].loc[:, 'age']
l2 = df[df['city'] == 'delhi'].iloc[:, 2]

print(l1)
print()
print(l2)

1    20
Name: age, dtype: int64

1    20
Name: age, dtype: int64

In [49]:
# create a dataFrame using series
# create two columns as series: first name and lastname

s1 = pd.Series(["manoj", "kusum", "nigaar", "safee", ])
s2 = pd.Series(["tripathi", "kumar", "mishra", "singh", ])

df2 = pd.DataFrame({
    # assinging as :- "column_name" : series_name
    "first_name": s1,
    "last_name": s2
})
df2

  first_name last_name
0      manoj  tripathi
1      kusum     kumar
2     nigaar    mishra
3      safee     singh